---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.LineLoad
source: html/1cc38a77-d394-dc5d-8537-6a376fda898a.htm
---
# LineLoad Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.